Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk0512gpl100.h
extern volatile __CFD2FIFOUA15bits_t CFD2FIFOUA15bits __asm__ ("CFD2FIFOUA15") __attribute__((section("sfrs"), address(0xBF881430)));
extern volatile uint32_t        CFD2FIFOUA15CLR __attribute__((section("sfrs"),address(0xBF881434)));
extern volatile uint32_t        CFD2FIFOUA15SET __attribute__((section("sfrs"),address(0xBF881438)));
extern volatile uint32_t        CFD2FIFOUA15INV __attribute__((section("sfrs"),address(0xBF88143C)));
#define CFD2FIFOCON16 CFD2FIFOCON16
extern volatile uint32_t   CFD2FIFOCON16 __attribute__((section("sfrs"), address(0xBF881440)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON16bits_t;
extern volatile __CFD2FIFOCON16bits_t CFD2FIFOCON16bits __asm__ ("CFD2FIFOCON16") __attribute__((section("sfrs"), address(0xBF881440)));
extern volatile uint32_t        CFD2FIFOCON16CLR __attribute__((section("sfrs"),address(0xBF881444)));
extern volatile uint32_t        CFD2FIFOCON16SET __attribute__((section("sfrs"),address(0xBF881448)));
extern volatile uint32_t        CFD2FIFOCON16INV __attribute__((section("sfrs"),address(0xBF88144C)));
#define CFD2FIFOSTA16 CFD2FIFOSTA16
extern volatile uint32_t   CFD2FIFOSTA16 __attribute__((section("sfrs"), address(0xBF881450)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA16bits_t;
extern volatile __CFD2FIFOSTA16bits_t CFD2FIFOSTA16bits __asm__ ("CFD2FIFOSTA16") __attribute__((section("sfrs"), address(0xBF881450)));
extern volatile uint32_t        CFD2FIFOSTA16CLR __attribute__((section("sfrs"),address(0xBF881454)));
extern volatile uint32_t        CFD2FIFOSTA16SET __attribute__((section("sfrs"),address(0xBF881458)));
extern volatile uint32_t        CFD2FIFOSTA16INV __attribute__((section("sfrs"),address(0xBF88145C)));
#define CFD2FIFOUA16 CFD2FIFOUA16
extern volatile uint32_t   CFD2FIFOUA16 __attribute__((section("sfrs"), address(0xBF881460)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA16bits_t;
extern volatile __CFD2FIFOUA16bits_t CFD2FIFOUA16bits __asm__ ("CFD2FIFOUA16") __attribute__((section("sfrs"), address(0xBF881460)));
extern volatile uint32_t        CFD2FIFOUA16CLR __attribute__((section("sfrs"),address(0xBF881464)));
extern volatile uint32_t        CFD2FIFOUA16SET __attribute__((section("sfrs"),address(0xBF881468)));
extern volatile uint32_t        CFD2FIFOUA16INV __attribute__((section("sfrs"),address(0xBF88146C)));
#define CFD2FIFOCON17 CFD2FIFOCON17
extern volatile uint32_t   CFD2FIFOCON17 __attribute__((section("sfrs"), address(0xBF881470)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON17bits_t;
extern volatile __CFD2FIFOCON17bits_t CFD2FIFOCON17bits __asm__ ("CFD2FIFOCON17") __attribute__((section("sfrs"), address(0xBF881470)));
extern volatile uint32_t        CFD2FIFOCON17CLR __attribute__((section("sfrs"),address(0xBF881474)));
extern volatile uint32_t        CFD2FIFOCON17SET __attribute__((section("sfrs"),address(0xBF881478)));
extern volatile uint32_t        CFD2FIFOCON17INV __attribute__((section("sfrs"),address(0xBF88147C)));
#define CFD2FIFOSTA17 CFD2FIFOSTA17
extern volatile uint32_t   CFD2FIFOSTA17 __attribute__((section("sfrs"), address(0xBF881480)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA17bits_t;
extern volatile __CFD2FIFOSTA17bits_t CFD2FIFOSTA17bits __asm__ ("CFD2FIFOSTA17") __attribute__((section("sfrs"), address(0xBF881480)));
extern volatile uint32_t        CFD2FIFOSTA17CLR __attribute__((section("sfrs"),address(0xBF881484)));
extern volatile uint32_t        CFD2FIFOSTA17SET __attribute__((section("sfrs"),address(0xBF881488)));
extern volatile uint32_t        CFD2FIFOSTA17INV __attribute__((section("sfrs"),address(0xBF88148C)));
#define CFD2FIFOUA17 CFD2FIFOUA17
extern volatile uint32_t   CFD2FIFOUA17 __attribute__((section("sfrs"), address(0xBF881490)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA17bits_t;
extern volatile __CFD2FIFOUA17bits_t CFD2FIFOUA17bits __asm__ ("CFD2FIFOUA17") __attribute__((section("sfrs"), address(0xBF881490)));
extern volatile uint32_t        CFD2FIFOUA17CLR __attribute__((section("sfrs"),address(0xBF881494)));
extern volatile uint32_t        CFD2FIFOUA17SET __attribute__((section("sfrs"),address(0xBF881498)));
extern volatile uint32_t        CFD2FIFOUA17INV __attribute__((section("sfrs"),address(0xBF88149C)));
#define CFD2FIFOCON18 CFD2FIFOCON18
extern volatile uint32_t   CFD2FIFOCON18 __attribute__((section("sfrs"), address(0xBF8814A0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD2FIFOCON18bits_t;
extern volatile __CFD2FIFOCON18bits_t CFD2FIFOCON18bits __asm__ ("CFD2FIFOCON18") __attribute__((section("sfrs"), address(0xBF8814A0)));
extern volatile uint32_t        CFD2FIFOCON18CLR __attribute__((section("sfrs"),address(0xBF8814A4)));
extern volatile uint32_t        CFD2FIFOCON18SET __attribute__((section("sfrs"),address(0xBF8814A8)));
extern volatile uint32_t        CFD2FIFOCON18INV __attribute__((section("sfrs"),address(0xBF8814AC)));
#define CFD2FIFOSTA18 CFD2FIFOSTA18
extern volatile uint32_t   CFD2FIFOSTA18 __attribute__((section("sfrs"), address(0xBF8814B0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD2FIFOSTA18bits_t;
extern volatile __CFD2FIFOSTA18bits_t CFD2FIFOSTA18bits __asm__ ("CFD2FIFOSTA18") __attribute__((section("sfrs"), address(0xBF8814B0)));
extern volatile uint32_t        CFD2FIFOSTA18CLR __attribute__((section("sfrs"),address(0xBF8814B4)));
extern volatile uint32_t        CFD2FIFOSTA18SET __attribute__((section("sfrs"),address(0xBF8814B8)));
extern volatile uint32_t        CFD2FIFOSTA18INV __attribute__((section("sfrs"),address(0xBF8814BC)));
#define CFD2FIFOUA18 CFD2FIFOUA18
extern volatile uint32_t   CFD2FIFOUA18 __attribute__((section("sfrs"), address(0xBF8814C0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD2FIFOUA18bits_t;
