Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk0512gpl100.h
extern volatile __CFD2MASK5bits_t CFD2MASK5bits __asm__ ("CFD2MASK5") __attribute__((section("sfrs"), address(0xBF881870)));
extern volatile uint32_t        CFD2MASK5CLR __attribute__((section("sfrs"),address(0xBF881874)));
extern volatile uint32_t        CFD2MASK5SET __attribute__((section("sfrs"),address(0xBF881878)));
extern volatile uint32_t        CFD2MASK5INV __attribute__((section("sfrs"),address(0xBF88187C)));
#define CFD2FLTOBJ6 CFD2FLTOBJ6
extern volatile uint32_t   CFD2FLTOBJ6 __attribute__((section("sfrs"), address(0xBF881880)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ6bits_t;
extern volatile __CFD2FLTOBJ6bits_t CFD2FLTOBJ6bits __asm__ ("CFD2FLTOBJ6") __attribute__((section("sfrs"), address(0xBF881880)));
extern volatile uint32_t        CFD2FLTOBJ6CLR __attribute__((section("sfrs"),address(0xBF881884)));
extern volatile uint32_t        CFD2FLTOBJ6SET __attribute__((section("sfrs"),address(0xBF881888)));
extern volatile uint32_t        CFD2FLTOBJ6INV __attribute__((section("sfrs"),address(0xBF88188C)));
#define CFD2MASK6 CFD2MASK6
extern volatile uint32_t   CFD2MASK6 __attribute__((section("sfrs"), address(0xBF881890)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK6bits_t;
extern volatile __CFD2MASK6bits_t CFD2MASK6bits __asm__ ("CFD2MASK6") __attribute__((section("sfrs"), address(0xBF881890)));
extern volatile uint32_t        CFD2MASK6CLR __attribute__((section("sfrs"),address(0xBF881894)));
extern volatile uint32_t        CFD2MASK6SET __attribute__((section("sfrs"),address(0xBF881898)));
extern volatile uint32_t        CFD2MASK6INV __attribute__((section("sfrs"),address(0xBF88189C)));
#define CFD2FLTOBJ7 CFD2FLTOBJ7
extern volatile uint32_t   CFD2FLTOBJ7 __attribute__((section("sfrs"), address(0xBF8818A0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ7bits_t;
extern volatile __CFD2FLTOBJ7bits_t CFD2FLTOBJ7bits __asm__ ("CFD2FLTOBJ7") __attribute__((section("sfrs"), address(0xBF8818A0)));
extern volatile uint32_t        CFD2FLTOBJ7CLR __attribute__((section("sfrs"),address(0xBF8818A4)));
extern volatile uint32_t        CFD2FLTOBJ7SET __attribute__((section("sfrs"),address(0xBF8818A8)));
extern volatile uint32_t        CFD2FLTOBJ7INV __attribute__((section("sfrs"),address(0xBF8818AC)));
#define CFD2MASK7 CFD2MASK7
extern volatile uint32_t   CFD2MASK7 __attribute__((section("sfrs"), address(0xBF8818B0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK7bits_t;
extern volatile __CFD2MASK7bits_t CFD2MASK7bits __asm__ ("CFD2MASK7") __attribute__((section("sfrs"), address(0xBF8818B0)));
extern volatile uint32_t        CFD2MASK7CLR __attribute__((section("sfrs"),address(0xBF8818B4)));
extern volatile uint32_t        CFD2MASK7SET __attribute__((section("sfrs"),address(0xBF8818B8)));
#define CFD2FLTOBJ8 CFD2FLTOBJ8
extern volatile uint32_t   CFD2FLTOBJ8 __attribute__((section("sfrs"), address(0xBF8818C0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ8bits_t;
extern volatile __CFD2FLTOBJ8bits_t CFD2FLTOBJ8bits __asm__ ("CFD2FLTOBJ8") __attribute__((section("sfrs"), address(0xBF8818C0)));
extern volatile uint32_t        CFD2FLTOBJ8CLR __attribute__((section("sfrs"),address(0xBF8818C4)));
extern volatile uint32_t        CFD2FLTOBJ8SET __attribute__((section("sfrs"),address(0xBF8818C8)));
extern volatile uint32_t        CFD2FLTOBJ8INV __attribute__((section("sfrs"),address(0xBF8818CC)));
#define CFD2MASK8 CFD2MASK8
extern volatile uint32_t   CFD2MASK8 __attribute__((section("sfrs"), address(0xBF8818D0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK8bits_t;
extern volatile __CFD2MASK8bits_t CFD2MASK8bits __asm__ ("CFD2MASK8") __attribute__((section("sfrs"), address(0xBF8818D0)));
extern volatile uint32_t        CFD2MASK8CLR __attribute__((section("sfrs"),address(0xBF8818D4)));
extern volatile uint32_t        CFD2MASK8SET __attribute__((section("sfrs"),address(0xBF8818D8)));
extern volatile uint32_t        CFD2MASK8INV __attribute__((section("sfrs"),address(0xBF8818DC)));
#define CFD2FLTOBJ9 CFD2FLTOBJ9
extern volatile uint32_t   CFD2FLTOBJ9 __attribute__((section("sfrs"), address(0xBF8818E0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ9bits_t;
extern volatile __CFD2FLTOBJ9bits_t CFD2FLTOBJ9bits __asm__ ("CFD2FLTOBJ9") __attribute__((section("sfrs"), address(0xBF8818E0)));
extern volatile uint32_t        CFD2FLTOBJ9CLR __attribute__((section("sfrs"),address(0xBF8818E4)));
extern volatile uint32_t        CFD2FLTOBJ9SET __attribute__((section("sfrs"),address(0xBF8818E8)));
extern volatile uint32_t        CFD2FLTOBJ9INV __attribute__((section("sfrs"),address(0xBF8818EC)));
#define CFD2MASK9 CFD2MASK9
extern volatile uint32_t   CFD2MASK9 __attribute__((section("sfrs"), address(0xBF8818F0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK9bits_t;
extern volatile __CFD2MASK9bits_t CFD2MASK9bits __asm__ ("CFD2MASK9") __attribute__((section("sfrs"), address(0xBF8818F0)));
extern volatile uint32_t        CFD2MASK9CLR __attribute__((section("sfrs"),address(0xBF8818F4)));
extern volatile uint32_t        CFD2MASK9SET __attribute__((section("sfrs"),address(0xBF8818F8)));
extern volatile uint32_t        CFD2MASK9INV __attribute__((section("sfrs"),address(0xBF8818FC)));
#define CFD2FLTOBJ10 CFD2FLTOBJ10
extern volatile uint32_t   CFD2FLTOBJ10 __attribute__((section("sfrs"), address(0xBF881900)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ10bits_t;
extern volatile __CFD2FLTOBJ10bits_t CFD2FLTOBJ10bits __asm__ ("CFD2FLTOBJ10") __attribute__((section("sfrs"), address(0xBF881900)));
extern volatile uint32_t        CFD2FLTOBJ10CLR __attribute__((section("sfrs"),address(0xBF881904)));
extern volatile uint32_t        CFD2FLTOBJ10SET __attribute__((section("sfrs"),address(0xBF881908)));
extern volatile uint32_t        CFD2FLTOBJ10INV __attribute__((section("sfrs"),address(0xBF88190C)));
#define CFD2MASK10 CFD2MASK10
extern volatile uint32_t   CFD2MASK10 __attribute__((section("sfrs"), address(0xBF881910)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK10bits_t;
extern volatile __CFD2MASK10bits_t CFD2MASK10bits __asm__ ("CFD2MASK10") __attribute__((section("sfrs"), address(0xBF881910)));
extern volatile uint32_t        CFD2MASK10CLR __attribute__((section("sfrs"),address(0xBF881914)));
extern volatile uint32_t        CFD2MASK10SET __attribute__((section("sfrs"),address(0xBF881918)));
extern volatile uint32_t        CFD2MASK10INV __attribute__((section("sfrs"),address(0xBF88191C)));
#define CFD2FLTOBJ11 CFD2FLTOBJ11
extern volatile uint32_t   CFD2FLTOBJ11 __attribute__((section("sfrs"), address(0xBF881920)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ11bits_t;
extern volatile __CFD2FLTOBJ11bits_t CFD2FLTOBJ11bits __asm__ ("CFD2FLTOBJ11") __attribute__((section("sfrs"), address(0xBF881920)));
extern volatile uint32_t        CFD2FLTOBJ11CLR __attribute__((section("sfrs"),address(0xBF881924)));
extern volatile uint32_t        CFD2FLTOBJ11SET __attribute__((section("sfrs"),address(0xBF881928)));
extern volatile uint32_t        CFD2FLTOBJ11INV __attribute__((section("sfrs"),address(0xBF88192C)));
#define CFD2MASK11 CFD2MASK11
extern volatile uint32_t   CFD2MASK11 __attribute__((section("sfrs"), address(0xBF881930)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK11bits_t;
extern volatile __CFD2MASK11bits_t CFD2MASK11bits __asm__ ("CFD2MASK11") __attribute__((section("sfrs"), address(0xBF881930)));
extern volatile uint32_t        CFD2MASK11CLR __attribute__((section("sfrs"),address(0xBF881934)));
extern volatile uint32_t        CFD2MASK11SET __attribute__((section("sfrs"),address(0xBF881938)));
extern volatile uint32_t        CFD2MASK11INV __attribute__((section("sfrs"),address(0xBF88193C)));
#define CFD2FLTOBJ12 CFD2FLTOBJ12
extern volatile uint32_t   CFD2FLTOBJ12 __attribute__((section("sfrs"), address(0xBF881940)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD2FLTOBJ12bits_t;
extern volatile __CFD2FLTOBJ12bits_t CFD2FLTOBJ12bits __asm__ ("CFD2FLTOBJ12") __attribute__((section("sfrs"), address(0xBF881940)));
extern volatile uint32_t        CFD2FLTOBJ12CLR __attribute__((section("sfrs"),address(0xBF881944)));
extern volatile uint32_t        CFD2FLTOBJ12SET __attribute__((section("sfrs"),address(0xBF881948)));
extern volatile uint32_t        CFD2FLTOBJ12INV __attribute__((section("sfrs"),address(0xBF88194C)));
#define CFD2MASK12 CFD2MASK12
extern volatile uint32_t   CFD2MASK12 __attribute__((section("sfrs"), address(0xBF881950)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD2MASK12bits_t;
