Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk0512gpl100.h
extern volatile __CFD3RXOVIFbits_t CFD3RXOVIFbits __asm__ ("CFD3RXOVIF") __attribute__((section("sfrs"), address(0xBF8840A0)));
extern volatile uint32_t        CFD3RXOVIFCLR __attribute__((section("sfrs"),address(0xBF8840A4)));
extern volatile uint32_t        CFD3RXOVIFSET __attribute__((section("sfrs"),address(0xBF8840A8)));
extern volatile uint32_t        CFD3RXOVIFINV __attribute__((section("sfrs"),address(0xBF8840AC)));
#define CFD3TXATIF CFD3TXATIF
extern volatile uint32_t   CFD3TXATIF __attribute__((section("sfrs"), address(0xBF8840B0)));
typedef struct {
  uint32_t TFATIF:32;
} __CFD3TXATIFbits_t;
extern volatile __CFD3TXATIFbits_t CFD3TXATIFbits __asm__ ("CFD3TXATIF") __attribute__((section("sfrs"), address(0xBF8840B0)));
extern volatile uint32_t        CFD3TXATIFCLR __attribute__((section("sfrs"),address(0xBF8840B4)));
extern volatile uint32_t        CFD3TXATIFSET __attribute__((section("sfrs"),address(0xBF8840B8)));
extern volatile uint32_t        CFD3TXATIFINV __attribute__((section("sfrs"),address(0xBF8840BC)));
#define CFD3TXREQ CFD3TXREQ
extern volatile uint32_t   CFD3TXREQ __attribute__((section("sfrs"), address(0xBF8840C0)));
typedef struct {
  uint32_t TXREQ:32;
} __CFD3TXREQbits_t;
extern volatile __CFD3TXREQbits_t CFD3TXREQbits __asm__ ("CFD3TXREQ") __attribute__((section("sfrs"), address(0xBF8840C0)));
extern volatile uint32_t        CFD3TXREQCLR __attribute__((section("sfrs"),address(0xBF8840C4)));
extern volatile uint32_t        CFD3TXREQSET __attribute__((section("sfrs"),address(0xBF8840C8)));
extern volatile uint32_t        CFD3TXREQINV __attribute__((section("sfrs"),address(0xBF8840CC)));
#define CFD3TREC CFD3TREC
extern volatile uint32_t   CFD3TREC __attribute__((section("sfrs"), address(0xBF8840D0)));
typedef union {
  struct {
    uint32_t RERRCNT:8;
    uint32_t TERRCNT:8;
    uint32_t EWARN:1;
    uint32_t RXWARN:1;
    uint32_t TXWARN:1;
    uint32_t RXBP:1;
    uint32_t TXBP:1;
    uint32_t TXBO:1;
  };
  struct {
    uint32_t w:32;
  };
} __CFD3TRECbits_t;
extern volatile __CFD3TRECbits_t CFD3TRECbits __asm__ ("CFD3TREC") __attribute__((section("sfrs"), address(0xBF8840D0)));
extern volatile uint32_t        CFD3TRECCLR __attribute__((section("sfrs"),address(0xBF8840D4)));
extern volatile uint32_t        CFD3TRECSET __attribute__((section("sfrs"),address(0xBF8840D8)));
extern volatile uint32_t        CFD3TRECINV __attribute__((section("sfrs"),address(0xBF8840DC)));
#define CFD3BDIAG0 CFD3BDIAG0
extern volatile uint32_t   CFD3BDIAG0 __attribute__((section("sfrs"), address(0xBF8840E0)));
typedef struct {
  uint32_t NRERRCNT:8;
  uint32_t NTERRCNT:8;
  uint32_t DRERRCNT:8;
  uint32_t DTERRCNT:8;
} __CFD3BDIAG0bits_t;
extern volatile __CFD3BDIAG0bits_t CFD3BDIAG0bits __asm__ ("CFD3BDIAG0") __attribute__((section("sfrs"), address(0xBF8840E0)));
extern volatile uint32_t        CFD3BDIAG0CLR __attribute__((section("sfrs"),address(0xBF8840E4)));
extern volatile uint32_t        CFD3BDIAG0SET __attribute__((section("sfrs"),address(0xBF8840E8)));
extern volatile uint32_t        CFD3BDIAG0INV __attribute__((section("sfrs"),address(0xBF8840EC)));
#define CFD3BDIAG1 CFD3BDIAG1
extern volatile uint32_t   CFD3BDIAG1 __attribute__((section("sfrs"), address(0xBF8840F0)));
typedef struct {
  uint32_t EFMSGCNT:16;
  uint32_t NBIT0ERR:1;
  uint32_t NBIT1ERR:1;
  uint32_t NACKERR:1;
  uint32_t NFORMERR:1;
  uint32_t NSTUFERR:1;
  uint32_t NCRCERR:1;
  uint32_t :2;
  uint32_t DBIT0ERR:1;
  uint32_t DBIT1ERR:1;
  uint32_t :1;
  uint32_t DFORMERR:1;
  uint32_t DSTUFERR:1;
  uint32_t DCRCERR:1;
  uint32_t ESI:1;
  uint32_t DLCMM:1;
} __CFD3BDIAG1bits_t;
extern volatile __CFD3BDIAG1bits_t CFD3BDIAG1bits __asm__ ("CFD3BDIAG1") __attribute__((section("sfrs"), address(0xBF8840F0)));
extern volatile uint32_t        CFD3BDIAG1CLR __attribute__((section("sfrs"),address(0xBF8840F4)));
extern volatile uint32_t        CFD3BDIAG1SET __attribute__((section("sfrs"),address(0xBF8840F8)));
extern volatile uint32_t        CFD3BDIAG1INV __attribute__((section("sfrs"),address(0xBF8840FC)));
#define CFD3TEFCON CFD3TEFCON
extern volatile uint32_t   CFD3TEFCON __attribute__((section("sfrs"), address(0xBF884100)));
typedef struct {
  uint32_t TEFNEIE:1;
  uint32_t TEFHIE:1;
  uint32_t TEFFIE:1;
  uint32_t TEFOVIE:1;
  uint32_t :1;
  uint32_t TEFTSEN:1;
  uint32_t :2;
  uint32_t UINC:1;
  uint32_t :1;
  uint32_t FRESET:1;
  uint32_t :13;
  uint32_t FSIZE:5;
} __CFD3TEFCONbits_t;
extern volatile __CFD3TEFCONbits_t CFD3TEFCONbits __asm__ ("CFD3TEFCON") __attribute__((section("sfrs"), address(0xBF884100)));
extern volatile uint32_t        CFD3TEFCONCLR __attribute__((section("sfrs"),address(0xBF884104)));
extern volatile uint32_t        CFD3TEFCONSET __attribute__((section("sfrs"),address(0xBF884108)));
extern volatile uint32_t        CFD3TEFCONINV __attribute__((section("sfrs"),address(0xBF88410C)));
#define CFD3TEFSTA CFD3TEFSTA
extern volatile uint32_t   CFD3TEFSTA __attribute__((section("sfrs"), address(0xBF884110)));
typedef struct {
  uint32_t TEFNEIF:1;
  uint32_t TEFHIF:1;
  uint32_t TEFFIF:1;
  uint32_t TEFOVIF:1;
} __CFD3TEFSTAbits_t;
extern volatile __CFD3TEFSTAbits_t CFD3TEFSTAbits __asm__ ("CFD3TEFSTA") __attribute__((section("sfrs"), address(0xBF884110)));
extern volatile uint32_t        CFD3TEFSTACLR __attribute__((section("sfrs"),address(0xBF884114)));
extern volatile uint32_t        CFD3TEFSTASET __attribute__((section("sfrs"),address(0xBF884118)));
extern volatile uint32_t        CFD3TEFSTAINV __attribute__((section("sfrs"),address(0xBF88411C)));
#define CFD3TEFUA CFD3TEFUA
extern volatile uint32_t   CFD3TEFUA __attribute__((section("sfrs"), address(0xBF884120)));
typedef struct {
  uint32_t TEFUA:32;
} __CFD3TEFUAbits_t;
extern volatile __CFD3TEFUAbits_t CFD3TEFUAbits __asm__ ("CFD3TEFUA") __attribute__((section("sfrs"), address(0xBF884120)));
extern volatile uint32_t        CFD3TEFUACLR __attribute__((section("sfrs"),address(0xBF884124)));
extern volatile uint32_t        CFD3TEFUASET __attribute__((section("sfrs"),address(0xBF884128)));
extern volatile uint32_t        CFD3TEFUAINV __attribute__((section("sfrs"),address(0xBF88412C)));
#define CFD3FIFOBA CFD3FIFOBA
extern volatile uint32_t   CFD3FIFOBA __attribute__((section("sfrs"), address(0xBF884130)));
typedef struct {
  uint32_t FIFOBA:32;
} __CFD3FIFOBAbits_t;
