Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk0512gpl100.h
extern volatile __CFD3FIFOBAbits_t CFD3FIFOBAbits __asm__ ("CFD3FIFOBA") __attribute__((section("sfrs"), address(0xBF884130)));
extern volatile uint32_t        CFD3FIFOBACLR __attribute__((section("sfrs"),address(0xBF884134)));
extern volatile uint32_t        CFD3FIFOBASET __attribute__((section("sfrs"),address(0xBF884138)));
extern volatile uint32_t        CFD3FIFOBAINV __attribute__((section("sfrs"),address(0xBF88413C)));
#define CFD3TXQCON CFD3TXQCON
extern volatile uint32_t   CFD3TXQCON __attribute__((section("sfrs"), address(0xBF884140)));
typedef struct {
  uint32_t TXQNIE:1;
  uint32_t :1;
  uint32_t TXQEIE:1;
  uint32_t :1;
  uint32_t TXATIE:1;
  uint32_t :2;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD3TXQCONbits_t;
extern volatile __CFD3TXQCONbits_t CFD3TXQCONbits __asm__ ("CFD3TXQCON") __attribute__((section("sfrs"), address(0xBF884140)));
extern volatile uint32_t        CFD3TXQCONCLR __attribute__((section("sfrs"),address(0xBF884144)));
extern volatile uint32_t        CFD3TXQCONSET __attribute__((section("sfrs"),address(0xBF884148)));
extern volatile uint32_t        CFD3TXQCONINV __attribute__((section("sfrs"),address(0xBF88414C)));
#define CFD3TXQSTA CFD3TXQSTA
extern volatile uint32_t   CFD3TXQSTA __attribute__((section("sfrs"), address(0xBF884150)));
typedef struct {
  uint32_t TXQNIF:1;
  uint32_t :1;
  uint32_t TXQEIF:1;
  uint32_t :1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t TXQCI:5;
} __CFD3TXQSTAbits_t;
extern volatile __CFD3TXQSTAbits_t CFD3TXQSTAbits __asm__ ("CFD3TXQSTA") __attribute__((section("sfrs"), address(0xBF884150)));
extern volatile uint32_t        CFD3TXQSTACLR __attribute__((section("sfrs"),address(0xBF884154)));
extern volatile uint32_t        CFD3TXQSTASET __attribute__((section("sfrs"),address(0xBF884158)));
extern volatile uint32_t        CFD3TXQSTAINV __attribute__((section("sfrs"),address(0xBF88415C)));
#define CFD3TXQUA CFD3TXQUA
extern volatile uint32_t   CFD3TXQUA __attribute__((section("sfrs"), address(0xBF884160)));
typedef struct {
  uint32_t TXQUA:32;
} __CFD3TXQUAbits_t;
extern volatile __CFD3TXQUAbits_t CFD3TXQUAbits __asm__ ("CFD3TXQUA") __attribute__((section("sfrs"), address(0xBF884160)));
extern volatile uint32_t        CFD3TXQUACLR __attribute__((section("sfrs"),address(0xBF884164)));
extern volatile uint32_t        CFD3TXQUASET __attribute__((section("sfrs"),address(0xBF884168)));
extern volatile uint32_t        CFD3TXQUAINV __attribute__((section("sfrs"),address(0xBF88416C)));
#define CFD3FIFOCON1 CFD3FIFOCON1
extern volatile uint32_t   CFD3FIFOCON1 __attribute__((section("sfrs"), address(0xBF884170)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD3FIFOCON1bits_t;
extern volatile __CFD3FIFOCON1bits_t CFD3FIFOCON1bits __asm__ ("CFD3FIFOCON1") __attribute__((section("sfrs"), address(0xBF884170)));
extern volatile uint32_t        CFD3FIFOCON1CLR __attribute__((section("sfrs"),address(0xBF884174)));
extern volatile uint32_t        CFD3FIFOCON1SET __attribute__((section("sfrs"),address(0xBF884178)));
extern volatile uint32_t        CFD3FIFOCON1INV __attribute__((section("sfrs"),address(0xBF88417C)));
#define CFD3FIFOSTA1 CFD3FIFOSTA1
extern volatile uint32_t   CFD3FIFOSTA1 __attribute__((section("sfrs"), address(0xBF884180)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD3FIFOSTA1bits_t;
extern volatile __CFD3FIFOSTA1bits_t CFD3FIFOSTA1bits __asm__ ("CFD3FIFOSTA1") __attribute__((section("sfrs"), address(0xBF884180)));
extern volatile uint32_t        CFD3FIFOSTA1CLR __attribute__((section("sfrs"),address(0xBF884184)));
extern volatile uint32_t        CFD3FIFOSTA1SET __attribute__((section("sfrs"),address(0xBF884188)));
extern volatile uint32_t        CFD3FIFOSTA1INV __attribute__((section("sfrs"),address(0xBF88418C)));
#define CFD3FIFOUA1 CFD3FIFOUA1
extern volatile uint32_t   CFD3FIFOUA1 __attribute__((section("sfrs"), address(0xBF884190)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD3FIFOUA1bits_t;
extern volatile __CFD3FIFOUA1bits_t CFD3FIFOUA1bits __asm__ ("CFD3FIFOUA1") __attribute__((section("sfrs"), address(0xBF884190)));
extern volatile uint32_t        CFD3FIFOUA1CLR __attribute__((section("sfrs"),address(0xBF884194)));
extern volatile uint32_t        CFD3FIFOUA1SET __attribute__((section("sfrs"),address(0xBF884198)));
extern volatile uint32_t        CFD3FIFOUA1INV __attribute__((section("sfrs"),address(0xBF88419C)));
#define CFD3FIFOCON2 CFD3FIFOCON2
extern volatile uint32_t   CFD3FIFOCON2 __attribute__((section("sfrs"), address(0xBF8841A0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD3FIFOCON2bits_t;
extern volatile __CFD3FIFOCON2bits_t CFD3FIFOCON2bits __asm__ ("CFD3FIFOCON2") __attribute__((section("sfrs"), address(0xBF8841A0)));
extern volatile uint32_t        CFD3FIFOCON2CLR __attribute__((section("sfrs"),address(0xBF8841A4)));
extern volatile uint32_t        CFD3FIFOCON2SET __attribute__((section("sfrs"),address(0xBF8841A8)));
extern volatile uint32_t        CFD3FIFOCON2INV __attribute__((section("sfrs"),address(0xBF8841AC)));
#define CFD3FIFOSTA2 CFD3FIFOSTA2
extern volatile uint32_t   CFD3FIFOSTA2 __attribute__((section("sfrs"), address(0xBF8841B0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD3FIFOSTA2bits_t;
extern volatile __CFD3FIFOSTA2bits_t CFD3FIFOSTA2bits __asm__ ("CFD3FIFOSTA2") __attribute__((section("sfrs"), address(0xBF8841B0)));
extern volatile uint32_t        CFD3FIFOSTA2CLR __attribute__((section("sfrs"),address(0xBF8841B4)));
extern volatile uint32_t        CFD3FIFOSTA2SET __attribute__((section("sfrs"),address(0xBF8841B8)));
extern volatile uint32_t        CFD3FIFOSTA2INV __attribute__((section("sfrs"),address(0xBF8841BC)));
#define CFD3FIFOUA2 CFD3FIFOUA2
extern volatile uint32_t   CFD3FIFOUA2 __attribute__((section("sfrs"), address(0xBF8841C0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD3FIFOUA2bits_t;
extern volatile __CFD3FIFOUA2bits_t CFD3FIFOUA2bits __asm__ ("CFD3FIFOUA2") __attribute__((section("sfrs"), address(0xBF8841C0)));
extern volatile uint32_t        CFD3FIFOUA2CLR __attribute__((section("sfrs"),address(0xBF8841C4)));
extern volatile uint32_t        CFD3FIFOUA2SET __attribute__((section("sfrs"),address(0xBF8841C8)));
extern volatile uint32_t        CFD3FIFOUA2INV __attribute__((section("sfrs"),address(0xBF8841CC)));
#define CFD3FIFOCON3 CFD3FIFOCON3
extern volatile uint32_t   CFD3FIFOCON3 __attribute__((section("sfrs"), address(0xBF8841D0)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD3FIFOCON3bits_t;
