Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk0512gpl100.h
extern volatile __CFD3FIFOCON3bits_t CFD3FIFOCON3bits __asm__ ("CFD3FIFOCON3") __attribute__((section("sfrs"), address(0xBF8841D0)));
extern volatile uint32_t        CFD3FIFOCON3CLR __attribute__((section("sfrs"),address(0xBF8841D4)));
extern volatile uint32_t        CFD3FIFOCON3SET __attribute__((section("sfrs"),address(0xBF8841D8)));
extern volatile uint32_t        CFD3FIFOCON3INV __attribute__((section("sfrs"),address(0xBF8841DC)));
#define CFD3FIFOSTA3 CFD3FIFOSTA3
extern volatile uint32_t   CFD3FIFOSTA3 __attribute__((section("sfrs"), address(0xBF8841E0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD3FIFOSTA3bits_t;
extern volatile __CFD3FIFOSTA3bits_t CFD3FIFOSTA3bits __asm__ ("CFD3FIFOSTA3") __attribute__((section("sfrs"), address(0xBF8841E0)));
extern volatile uint32_t        CFD3FIFOSTA3CLR __attribute__((section("sfrs"),address(0xBF8841E4)));
extern volatile uint32_t        CFD3FIFOSTA3SET __attribute__((section("sfrs"),address(0xBF8841E8)));
extern volatile uint32_t        CFD3FIFOSTA3INV __attribute__((section("sfrs"),address(0xBF8841EC)));
#define CFD3FIFOUA3 CFD3FIFOUA3
extern volatile uint32_t   CFD3FIFOUA3 __attribute__((section("sfrs"), address(0xBF8841F0)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD3FIFOUA3bits_t;
extern volatile __CFD3FIFOUA3bits_t CFD3FIFOUA3bits __asm__ ("CFD3FIFOUA3") __attribute__((section("sfrs"), address(0xBF8841F0)));
extern volatile uint32_t        CFD3FIFOUA3CLR __attribute__((section("sfrs"),address(0xBF8841F4)));
extern volatile uint32_t        CFD3FIFOUA3SET __attribute__((section("sfrs"),address(0xBF8841F8)));
extern volatile uint32_t        CFD3FIFOUA3INV __attribute__((section("sfrs"),address(0xBF8841FC)));
#define CFD3FIFOCON4 CFD3FIFOCON4
extern volatile uint32_t   CFD3FIFOCON4 __attribute__((section("sfrs"), address(0xBF884200)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD3FIFOCON4bits_t;
extern volatile __CFD3FIFOCON4bits_t CFD3FIFOCON4bits __asm__ ("CFD3FIFOCON4") __attribute__((section("sfrs"), address(0xBF884200)));
extern volatile uint32_t        CFD3FIFOCON4CLR __attribute__((section("sfrs"),address(0xBF884204)));
extern volatile uint32_t        CFD3FIFOCON4SET __attribute__((section("sfrs"),address(0xBF884208)));
extern volatile uint32_t        CFD3FIFOCON4INV __attribute__((section("sfrs"),address(0xBF88420C)));
#define CFD3FIFOSTA4 CFD3FIFOSTA4
extern volatile uint32_t   CFD3FIFOSTA4 __attribute__((section("sfrs"), address(0xBF884210)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD3FIFOSTA4bits_t;
extern volatile __CFD3FIFOSTA4bits_t CFD3FIFOSTA4bits __asm__ ("CFD3FIFOSTA4") __attribute__((section("sfrs"), address(0xBF884210)));
extern volatile uint32_t        CFD3FIFOSTA4CLR __attribute__((section("sfrs"),address(0xBF884214)));
extern volatile uint32_t        CFD3FIFOSTA4SET __attribute__((section("sfrs"),address(0xBF884218)));
extern volatile uint32_t        CFD3FIFOSTA4INV __attribute__((section("sfrs"),address(0xBF88421C)));
#define CFD3FIFOUA4 CFD3FIFOUA4
extern volatile uint32_t   CFD3FIFOUA4 __attribute__((section("sfrs"), address(0xBF884220)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD3FIFOUA4bits_t;
extern volatile __CFD3FIFOUA4bits_t CFD3FIFOUA4bits __asm__ ("CFD3FIFOUA4") __attribute__((section("sfrs"), address(0xBF884220)));
extern volatile uint32_t        CFD3FIFOUA4CLR __attribute__((section("sfrs"),address(0xBF884224)));
extern volatile uint32_t        CFD3FIFOUA4SET __attribute__((section("sfrs"),address(0xBF884228)));
extern volatile uint32_t        CFD3FIFOUA4INV __attribute__((section("sfrs"),address(0xBF88422C)));
#define CFD3FIFOCON5 CFD3FIFOCON5
extern volatile uint32_t   CFD3FIFOCON5 __attribute__((section("sfrs"), address(0xBF884230)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD3FIFOCON5bits_t;
extern volatile __CFD3FIFOCON5bits_t CFD3FIFOCON5bits __asm__ ("CFD3FIFOCON5") __attribute__((section("sfrs"), address(0xBF884230)));
extern volatile uint32_t        CFD3FIFOCON5CLR __attribute__((section("sfrs"),address(0xBF884234)));
extern volatile uint32_t        CFD3FIFOCON5SET __attribute__((section("sfrs"),address(0xBF884238)));
extern volatile uint32_t        CFD3FIFOCON5INV __attribute__((section("sfrs"),address(0xBF88423C)));
#define CFD3FIFOSTA5 CFD3FIFOSTA5
extern volatile uint32_t   CFD3FIFOSTA5 __attribute__((section("sfrs"), address(0xBF884240)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD3FIFOSTA5bits_t;
extern volatile __CFD3FIFOSTA5bits_t CFD3FIFOSTA5bits __asm__ ("CFD3FIFOSTA5") __attribute__((section("sfrs"), address(0xBF884240)));
extern volatile uint32_t        CFD3FIFOSTA5CLR __attribute__((section("sfrs"),address(0xBF884244)));
extern volatile uint32_t        CFD3FIFOSTA5SET __attribute__((section("sfrs"),address(0xBF884248)));
extern volatile uint32_t        CFD3FIFOSTA5INV __attribute__((section("sfrs"),address(0xBF88424C)));
#define CFD3FIFOUA5 CFD3FIFOUA5
extern volatile uint32_t   CFD3FIFOUA5 __attribute__((section("sfrs"), address(0xBF884250)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD3FIFOUA5bits_t;
extern volatile __CFD3FIFOUA5bits_t CFD3FIFOUA5bits __asm__ ("CFD3FIFOUA5") __attribute__((section("sfrs"), address(0xBF884250)));
extern volatile uint32_t        CFD3FIFOUA5CLR __attribute__((section("sfrs"),address(0xBF884254)));
extern volatile uint32_t        CFD3FIFOUA5SET __attribute__((section("sfrs"),address(0xBF884258)));
extern volatile uint32_t        CFD3FIFOUA5INV __attribute__((section("sfrs"),address(0xBF88425C)));
#define CFD3FIFOCON6 CFD3FIFOCON6
extern volatile uint32_t   CFD3FIFOCON6 __attribute__((section("sfrs"), address(0xBF884260)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD3FIFOCON6bits_t;
extern volatile __CFD3FIFOCON6bits_t CFD3FIFOCON6bits __asm__ ("CFD3FIFOCON6") __attribute__((section("sfrs"), address(0xBF884260)));
extern volatile uint32_t        CFD3FIFOCON6CLR __attribute__((section("sfrs"),address(0xBF884264)));
extern volatile uint32_t        CFD3FIFOCON6SET __attribute__((section("sfrs"),address(0xBF884268)));
extern volatile uint32_t        CFD3FIFOCON6INV __attribute__((section("sfrs"),address(0xBF88426C)));
#define CFD3FIFOSTA6 CFD3FIFOSTA6
extern volatile uint32_t   CFD3FIFOSTA6 __attribute__((section("sfrs"), address(0xBF884270)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD3FIFOSTA6bits_t;
extern volatile __CFD3FIFOSTA6bits_t CFD3FIFOSTA6bits __asm__ ("CFD3FIFOSTA6") __attribute__((section("sfrs"), address(0xBF884270)));
extern volatile uint32_t        CFD3FIFOSTA6CLR __attribute__((section("sfrs"),address(0xBF884274)));
extern volatile uint32_t        CFD3FIFOSTA6SET __attribute__((section("sfrs"),address(0xBF884278)));
extern volatile uint32_t        CFD3FIFOSTA6INV __attribute__((section("sfrs"),address(0xBF88427C)));
#define CFD3FIFOUA6 CFD3FIFOUA6
extern volatile uint32_t   CFD3FIFOUA6 __attribute__((section("sfrs"), address(0xBF884280)));
typedef struct {
  uint32_t FIFOUA:32;
} __CFD3FIFOUA6bits_t;
extern volatile __CFD3FIFOUA6bits_t CFD3FIFOUA6bits __asm__ ("CFD3FIFOUA6") __attribute__((section("sfrs"), address(0xBF884280)));
extern volatile uint32_t        CFD3FIFOUA6CLR __attribute__((section("sfrs"),address(0xBF884284)));
extern volatile uint32_t        CFD3FIFOUA6SET __attribute__((section("sfrs"),address(0xBF884288)));
extern volatile uint32_t        CFD3FIFOUA6INV __attribute__((section("sfrs"),address(0xBF88428C)));
#define CFD3FIFOCON7 CFD3FIFOCON7
extern volatile uint32_t   CFD3FIFOCON7 __attribute__((section("sfrs"), address(0xBF884290)));
typedef struct {
  uint32_t TFNRFNIE:1;
  uint32_t TFHRFHIE:1;
  uint32_t TFERFFIE:1;
  uint32_t RXOVIE:1;
  uint32_t TXATIE:1;
  uint32_t RXTSEN:1;
  uint32_t RTREN:1;
  uint32_t TXEN:1;
  uint32_t UINC:1;
  uint32_t TXREQ:1;
  uint32_t FRESET:1;
  uint32_t :5;
  uint32_t TXPRI:5;
  uint32_t TXAT:2;
  uint32_t :1;
  uint32_t FSIZE:5;
  uint32_t PLSIZE:3;
} __CFD3FIFOCON7bits_t;
extern volatile __CFD3FIFOCON7bits_t CFD3FIFOCON7bits __asm__ ("CFD3FIFOCON7") __attribute__((section("sfrs"), address(0xBF884290)));
extern volatile uint32_t        CFD3FIFOCON7CLR __attribute__((section("sfrs"),address(0xBF884294)));
extern volatile uint32_t        CFD3FIFOCON7SET __attribute__((section("sfrs"),address(0xBF884298)));
extern volatile uint32_t        CFD3FIFOCON7INV __attribute__((section("sfrs"),address(0xBF88429C)));
#define CFD3FIFOSTA7 CFD3FIFOSTA7
extern volatile uint32_t   CFD3FIFOSTA7 __attribute__((section("sfrs"), address(0xBF8842A0)));
typedef struct {
  uint32_t TFNRFNIF:1;
  uint32_t TFHRFHIF:1;
  uint32_t TFERFFIF:1;
  uint32_t RXOVIF:1;
  uint32_t TXATIF:1;
  uint32_t TXERR:1;
  uint32_t TXLARB:1;
  uint32_t TXABT:1;
  uint32_t FIFOCI:5;
} __CFD3FIFOSTA7bits_t;
