Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk0512gpl100.h
extern volatile __CFD4FIFOUA31bits_t CFD4FIFOUA31bits __asm__ ("CFD4FIFOUA31") __attribute__((section("sfrs"), address(0xBF885730)));
extern volatile uint32_t        CFD4FIFOUA31CLR __attribute__((section("sfrs"),address(0xBF885734)));
extern volatile uint32_t        CFD4FIFOUA31SET __attribute__((section("sfrs"),address(0xBF885738)));
extern volatile uint32_t        CFD4FIFOUA31INV __attribute__((section("sfrs"),address(0xBF88573C)));
#define CFD4FLTCON0 CFD4FLTCON0
extern volatile uint32_t   CFD4FLTCON0 __attribute__((section("sfrs"), address(0xBF885740)));
typedef struct {
  uint32_t F0BP:5;
  uint32_t :2;
  uint32_t FLTEN0:1;
  uint32_t F1BP:5;
  uint32_t :2;
  uint32_t FLTEN1:1;
  uint32_t F2BP:5;
  uint32_t :2;
  uint32_t FLTEN2:1;
  uint32_t F3BP:5;
  uint32_t :2;
  uint32_t FLTEN3:1;
} __CFD4FLTCON0bits_t;
extern volatile __CFD4FLTCON0bits_t CFD4FLTCON0bits __asm__ ("CFD4FLTCON0") __attribute__((section("sfrs"), address(0xBF885740)));
extern volatile uint32_t        CFD4FLTCON0CLR __attribute__((section("sfrs"),address(0xBF885744)));
extern volatile uint32_t        CFD4FLTCON0SET __attribute__((section("sfrs"),address(0xBF885748)));
extern volatile uint32_t        CFD4FLTCON0INV __attribute__((section("sfrs"),address(0xBF88574C)));
#define CFD4FLTCON1 CFD4FLTCON1
extern volatile uint32_t   CFD4FLTCON1 __attribute__((section("sfrs"), address(0xBF885750)));
typedef struct {
  uint32_t F4BP:5;
  uint32_t :2;
  uint32_t FLTEN4:1;
  uint32_t F5BP:5;
  uint32_t :2;
  uint32_t FLTEN5:1;
  uint32_t F6BP:5;
  uint32_t :2;
  uint32_t FLTEN6:1;
  uint32_t F7BP:5;
  uint32_t :2;
  uint32_t FLTEN7:1;
} __CFD4FLTCON1bits_t;
extern volatile __CFD4FLTCON1bits_t CFD4FLTCON1bits __asm__ ("CFD4FLTCON1") __attribute__((section("sfrs"), address(0xBF885750)));
extern volatile uint32_t        CFD4FLTCON1CLR __attribute__((section("sfrs"),address(0xBF885754)));
extern volatile uint32_t        CFD4FLTCON1SET __attribute__((section("sfrs"),address(0xBF885758)));
extern volatile uint32_t        CFD4FLTCON1INV __attribute__((section("sfrs"),address(0xBF88575C)));
#define CFD4FLTCON2 CFD4FLTCON2
extern volatile uint32_t   CFD4FLTCON2 __attribute__((section("sfrs"), address(0xBF885760)));
typedef struct {
  uint32_t F8BP:5;
  uint32_t :2;
  uint32_t FLTEN8:1;
  uint32_t F9BP:5;
  uint32_t :2;
  uint32_t FLTEN9:1;
  uint32_t F10BP:5;
  uint32_t :2;
  uint32_t FLTEN10:1;
  uint32_t F11BP:5;
  uint32_t :2;
  uint32_t FLTEN11:1;
} __CFD4FLTCON2bits_t;
extern volatile __CFD4FLTCON2bits_t CFD4FLTCON2bits __asm__ ("CFD4FLTCON2") __attribute__((section("sfrs"), address(0xBF885760)));
extern volatile uint32_t        CFD4FLTCON2CLR __attribute__((section("sfrs"),address(0xBF885764)));
extern volatile uint32_t        CFD4FLTCON2SET __attribute__((section("sfrs"),address(0xBF885768)));
extern volatile uint32_t        CFD4FLTCON2INV __attribute__((section("sfrs"),address(0xBF88576C)));
#define CFD4FLTCON3 CFD4FLTCON3
extern volatile uint32_t   CFD4FLTCON3 __attribute__((section("sfrs"), address(0xBF885770)));
typedef struct {
  uint32_t F12BP:5;
  uint32_t :2;
  uint32_t FLTEN12:1;
  uint32_t F13BP:5;
  uint32_t :2;
  uint32_t FLTEN13:1;
  uint32_t F14BP:5;
  uint32_t :2;
  uint32_t FLTEN14:1;
  uint32_t F15BP:5;
  uint32_t :2;
  uint32_t FLTEN15:1;
} __CFD4FLTCON3bits_t;
extern volatile __CFD4FLTCON3bits_t CFD4FLTCON3bits __asm__ ("CFD4FLTCON3") __attribute__((section("sfrs"), address(0xBF885770)));
extern volatile uint32_t        CFD4FLTCON3CLR __attribute__((section("sfrs"),address(0xBF885774)));
extern volatile uint32_t        CFD4FLTCON3SET __attribute__((section("sfrs"),address(0xBF885778)));
extern volatile uint32_t        CFD4FLTCON3INV __attribute__((section("sfrs"),address(0xBF88577C)));
#define CFD4FLTCON4 CFD4FLTCON4
extern volatile uint32_t   CFD4FLTCON4 __attribute__((section("sfrs"), address(0xBF885780)));
typedef struct {
  uint32_t F16BP:5;
  uint32_t :2;
  uint32_t FLTEN16:1;
  uint32_t F17BP:5;
  uint32_t :2;
  uint32_t FLTEN17:1;
  uint32_t F18BP:5;
  uint32_t :2;
  uint32_t FLTEN18:1;
  uint32_t F19BP:5;
  uint32_t :2;
  uint32_t FLTEN19:1;
} __CFD4FLTCON4bits_t;
extern volatile __CFD4FLTCON4bits_t CFD4FLTCON4bits __asm__ ("CFD4FLTCON4") __attribute__((section("sfrs"), address(0xBF885780)));
extern volatile uint32_t        CFD4FLTCON4CLR __attribute__((section("sfrs"),address(0xBF885784)));
extern volatile uint32_t        CFD4FLTCON4SET __attribute__((section("sfrs"),address(0xBF885788)));
extern volatile uint32_t        CFD4FLTCON4INV __attribute__((section("sfrs"),address(0xBF88578C)));
#define CFD4FLTCON5 CFD4FLTCON5
extern volatile uint32_t   CFD4FLTCON5 __attribute__((section("sfrs"), address(0xBF885790)));
typedef struct {
  uint32_t F20BP:5;
  uint32_t :2;
  uint32_t FLTEN20:1;
  uint32_t F21BP:5;
  uint32_t :2;
  uint32_t FLTEN21:1;
  uint32_t F22BP:5;
  uint32_t :2;
  uint32_t FLTEN22:1;
  uint32_t F23BP:5;
  uint32_t :2;
  uint32_t FLTEN23:1;
} __CFD4FLTCON5bits_t;
extern volatile __CFD4FLTCON5bits_t CFD4FLTCON5bits __asm__ ("CFD4FLTCON5") __attribute__((section("sfrs"), address(0xBF885790)));
extern volatile uint32_t        CFD4FLTCON5CLR __attribute__((section("sfrs"),address(0xBF885794)));
extern volatile uint32_t        CFD4FLTCON5SET __attribute__((section("sfrs"),address(0xBF885798)));
extern volatile uint32_t        CFD4FLTCON5INV __attribute__((section("sfrs"),address(0xBF88579C)));
#define CFD4FLTCON6 CFD4FLTCON6
extern volatile uint32_t   CFD4FLTCON6 __attribute__((section("sfrs"), address(0xBF8857A0)));
typedef struct {
  uint32_t F24BP:5;
  uint32_t :2;
  uint32_t FLTEN24:1;
  uint32_t F25BP:5;
  uint32_t :2;
  uint32_t FLTEN25:1;
  uint32_t F26BP:5;
  uint32_t :2;
  uint32_t FLTEN26:1;
  uint32_t F27BP:5;
  uint32_t :2;
  uint32_t FLTEN27:1;
} __CFD4FLTCON6bits_t;
extern volatile __CFD4FLTCON6bits_t CFD4FLTCON6bits __asm__ ("CFD4FLTCON6") __attribute__((section("sfrs"), address(0xBF8857A0)));
extern volatile uint32_t        CFD4FLTCON6CLR __attribute__((section("sfrs"),address(0xBF8857A4)));
extern volatile uint32_t        CFD4FLTCON6SET __attribute__((section("sfrs"),address(0xBF8857A8)));
extern volatile uint32_t        CFD4FLTCON6INV __attribute__((section("sfrs"),address(0xBF8857AC)));
#define CFD4FLTCON7 CFD4FLTCON7
extern volatile uint32_t   CFD4FLTCON7 __attribute__((section("sfrs"), address(0xBF8857B0)));
typedef struct {
  uint32_t F28BP:5;
  uint32_t :2;
  uint32_t FLTEN28:1;
  uint32_t F29BP:5;
  uint32_t :2;
  uint32_t FLTEN29:1;
  uint32_t F30BP:5;
  uint32_t :2;
  uint32_t FLTEN30:1;
  uint32_t F31BP:5;
  uint32_t :2;
  uint32_t FLTEN31:1;
} __CFD4FLTCON7bits_t;
extern volatile __CFD4FLTCON7bits_t CFD4FLTCON7bits __asm__ ("CFD4FLTCON7") __attribute__((section("sfrs"), address(0xBF8857B0)));
extern volatile uint32_t        CFD4FLTCON7CLR __attribute__((section("sfrs"),address(0xBF8857B4)));
extern volatile uint32_t        CFD4FLTCON7SET __attribute__((section("sfrs"),address(0xBF8857B8)));
extern volatile uint32_t        CFD4FLTCON7INV __attribute__((section("sfrs"),address(0xBF8857BC)));
#define CFD4FLTOBJ0 CFD4FLTOBJ0
extern volatile uint32_t   CFD4FLTOBJ0 __attribute__((section("sfrs"), address(0xBF8857C0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD4FLTOBJ0bits_t;
extern volatile __CFD4FLTOBJ0bits_t CFD4FLTOBJ0bits __asm__ ("CFD4FLTOBJ0") __attribute__((section("sfrs"), address(0xBF8857C0)));
extern volatile uint32_t        CFD4FLTOBJ0CLR __attribute__((section("sfrs"),address(0xBF8857C4)));
extern volatile uint32_t        CFD4FLTOBJ0SET __attribute__((section("sfrs"),address(0xBF8857C8)));
extern volatile uint32_t        CFD4FLTOBJ0INV __attribute__((section("sfrs"),address(0xBF8857CC)));
#define CFD4MASK0 CFD4MASK0
extern volatile uint32_t   CFD4MASK0 __attribute__((section("sfrs"), address(0xBF8857D0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD4MASK0bits_t;
extern volatile __CFD4MASK0bits_t CFD4MASK0bits __asm__ ("CFD4MASK0") __attribute__((section("sfrs"), address(0xBF8857D0)));
extern volatile uint32_t        CFD4MASK0CLR __attribute__((section("sfrs"),address(0xBF8857D4)));
extern volatile uint32_t        CFD4MASK0SET __attribute__((section("sfrs"),address(0xBF8857D8)));
extern volatile uint32_t        CFD4MASK0INV __attribute__((section("sfrs"),address(0xBF8857DC)));
#define CFD4FLTOBJ1 CFD4FLTOBJ1
extern volatile uint32_t   CFD4FLTOBJ1 __attribute__((section("sfrs"), address(0xBF8857E0)));
typedef struct {
  uint32_t SID:11;
  uint32_t EID:18;
  uint32_t SID11:1;
  uint32_t EXIDE:1;
} __CFD4FLTOBJ1bits_t;
extern volatile __CFD4FLTOBJ1bits_t CFD4FLTOBJ1bits __asm__ ("CFD4FLTOBJ1") __attribute__((section("sfrs"), address(0xBF8857E0)));
extern volatile uint32_t        CFD4FLTOBJ1CLR __attribute__((section("sfrs"),address(0xBF8857E4)));
extern volatile uint32_t        CFD4FLTOBJ1SET __attribute__((section("sfrs"),address(0xBF8857E8)));
extern volatile uint32_t        CFD4FLTOBJ1INV __attribute__((section("sfrs"),address(0xBF8857EC)));
#define CFD4MASK1 CFD4MASK1
extern volatile uint32_t   CFD4MASK1 __attribute__((section("sfrs"), address(0xBF8857F0)));
typedef struct {
  uint32_t MSID:11;
  uint32_t MEID:18;
  uint32_t MSID11:1;
  uint32_t MIDE:1;
} __CFD4MASK1bits_t;
