Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk0512gpl100.h
extern volatile __DEVCFG4bits_t DEVCFG4bits __asm__ ("DEVCFG4") __attribute__((section("sfrs"), address(0xBFC03FBC)));
#define DEVCFG3 DEVCFG3
extern volatile uint32_t   DEVCFG3 __attribute__((section("sfrs"), address(0xBFC03FC0)));
typedef union {
  struct {
    uint32_t USERID:16;
    uint32_t :6;
    uint32_t FUSBIDIO2:1;
    uint32_t FVBUSIO2:1;
    uint32_t :3;
    uint32_t PGL1WAY:1;
    uint32_t PMDL1WAY:1;
    uint32_t IOL1WAY:1;
    uint32_t FUSBIDIO1:1;
    uint32_t FVBUSIO1:1;
  };
  struct {
    uint32_t w:32;
  };
} __DEVCFG3bits_t;
extern volatile __DEVCFG3bits_t DEVCFG3bits __asm__ ("DEVCFG3") __attribute__((section("sfrs"), address(0xBFC03FC0)));
#define DEVCFG2 DEVCFG2
extern volatile uint32_t   DEVCFG2 __attribute__((section("sfrs"), address(0xBFC03FC4)));
typedef union {
  struct {
    uint32_t FPLLIDIV:3;
    uint32_t :1;
    uint32_t FPLLRNG:3;
    uint32_t FPLLICLK:1;
    uint32_t FPLLMULT:7;
    uint32_t :1;
    uint32_t FPLLODIV:3;
    uint32_t :1;
    uint32_t DSBOREN:1;
    uint32_t DSWDTPS:5;
    uint32_t DSWDTOSC:1;
    uint32_t DSWDTEN:1;
    uint32_t FDSEN:1;
    uint32_t BORSEL:1;
    uint32_t :1;
    uint32_t UPLLEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __DEVCFG2bits_t;
extern volatile __DEVCFG2bits_t DEVCFG2bits __asm__ ("DEVCFG2") __attribute__((section("sfrs"), address(0xBFC03FC4)));
#define DEVCFG1 DEVCFG1
extern volatile uint32_t   DEVCFG1 __attribute__((section("sfrs"), address(0xBFC03FC8)));
typedef union {
  struct {
    uint32_t FNOSC:3;
    uint32_t DMTINTV:3;
    uint32_t FSOSCEN:1;
    uint32_t IESO:1;
    uint32_t POSCMOD:2;
    uint32_t OSCIOFNC:1;
    uint32_t :3;
    uint32_t FCKSM:2;
    uint32_t WDTPS:5;
    uint32_t WDTSPGM:1;
    uint32_t WINDIS:1;
    uint32_t FWDTEN:1;
    uint32_t FWDTWINSZ:2;
    uint32_t DMTCNT:5;
    uint32_t FDMTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __DEVCFG1bits_t;
extern volatile __DEVCFG1bits_t DEVCFG1bits __asm__ ("DEVCFG1") __attribute__((section("sfrs"), address(0xBFC03FC8)));
#define DEVCFG0 DEVCFG0
extern volatile uint32_t   DEVCFG0 __attribute__((section("sfrs"), address(0xBFC03FCC)));
typedef union {
  struct {
    uint32_t DEBUG:2;
    uint32_t JTAGEN:1;
    uint32_t ICESEL:2;
    uint32_t TRCEN:1;
    uint32_t BOOTISA:1;
    uint32_t :1;
    uint32_t FECCCON:2;
    uint32_t FSLEEP:1;
    uint32_t :1;
    uint32_t DBGPER:3;
    uint32_t SMCLR:1;
    uint32_t SOSCGAIN:2;
    uint32_t SOSCBOOST:1;
    uint32_t POSCGAIN:2;
    uint32_t POSCBOOST:1;
    uint32_t POSCFGAIN:2;
    uint32_t POSCAGCDLY:2;
    uint32_t POSCAGCRNG:1;
    uint32_t POSCAGC:1;
    uint32_t :2;
    uint32_t EJTAGBEN:1;
  };
  struct {
    uint32_t FDEBUG:2;
  };
  struct {
    uint32_t w:32;
  };
} __DEVCFG0bits_t;
extern volatile __DEVCFG0bits_t DEVCFG0bits __asm__ ("DEVCFG0") __attribute__((section("sfrs"), address(0xBFC03FCC)));
#define DEVCP DEVCP
extern volatile uint32_t   DEVCP __attribute__((section("sfrs"), address(0xBFC03FDC)));
typedef union {
  struct {
    uint32_t :28;
    uint32_t CP:1;
  };
  struct {
    uint32_t w:32;
  };
} __DEVCPbits_t;
extern volatile __DEVCPbits_t DEVCPbits __asm__ ("DEVCP") __attribute__((section("sfrs"), address(0xBFC03FDC)));
#define DEVSIGN DEVSIGN
extern volatile uint32_t   DEVSIGN __attribute__((section("sfrs"), address(0xBFC03FEC)));
#define SEQ SEQ
extern volatile uint32_t   SEQ __attribute__((section("sfrs"), address(0xBFC03FF0)));
typedef union {
  struct {
    uint32_t TSEQ:16;
    uint32_t CSEQ:16;
  };
  struct {
    uint32_t w:32;
  };
} __SEQbits_t;
extern volatile __SEQbits_t SEQbits __asm__ ("SEQ") __attribute__((section("sfrs"), address(0xBFC03FF0)));
#define DEVADC0 DEVADC0
extern volatile uint32_t   DEVADC0 __attribute__((section("sfrs"), address(0xBFC45000)));
typedef union {
  struct {
    uint32_t ADCCALDATA:32;
  };
  struct {
    uint32_t w:32;
  };
} __DEVADC0bits_t;
extern volatile __DEVADC0bits_t DEVADC0bits __asm__ ("DEVADC0") __attribute__((section("sfrs"), address(0xBFC45000)));
#define DEVADC1 DEVADC1
extern volatile uint32_t   DEVADC1 __attribute__((section("sfrs"), address(0xBFC45004)));
typedef union {
  struct {
    uint32_t ADCCALDATA:32;
  };
  struct {
    uint32_t w:32;
  };
} __DEVADC1bits_t;
extern volatile __DEVADC1bits_t DEVADC1bits __asm__ ("DEVADC1") __attribute__((section("sfrs"), address(0xBFC45004)));
#define DEVADC2 DEVADC2
extern volatile uint32_t   DEVADC2 __attribute__((section("sfrs"), address(0xBFC45008)));
typedef union {
  struct {
    uint32_t ADCCALDATA:32;
  };
  struct {
    uint32_t w:32;
  };
} __DEVADC2bits_t;
extern volatile __DEVADC2bits_t DEVADC2bits __asm__ ("DEVADC2") __attribute__((section("sfrs"), address(0xBFC45008)));
#define DEVADC3 DEVADC3
extern volatile uint32_t   DEVADC3 __attribute__((section("sfrs"), address(0xBFC4500C)));
typedef union {
  struct {
    uint32_t ADCCALDATA:32;
  };
  struct {
    uint32_t w:32;
  };
} __DEVADC3bits_t;
extern volatile __DEVADC3bits_t DEVADC3bits __asm__ ("DEVADC3") __attribute__((section("sfrs"), address(0xBFC4500C)));
#define DEVADC4 DEVADC4
extern volatile uint32_t   DEVADC4 __attribute__((section("sfrs"), address(0xBFC45010)));
typedef union {
  struct {
    uint32_t ADCCALDATA:32;
  };
  struct {
    uint32_t w:32;
  };
} __DEVADC4bits_t;
extern volatile __DEVADC4bits_t DEVADC4bits __asm__ ("DEVADC4") __attribute__((section("sfrs"), address(0xBFC45010)));
#define DEVADC5 DEVADC5
extern volatile uint32_t   DEVADC5 __attribute__((section("sfrs"), address(0xBFC45014)));
typedef union {
  struct {
    uint32_t ADCCALDATA:32;
  };
  struct {
    uint32_t w:32;
  };
} __DEVADC5bits_t;
extern volatile __DEVADC5bits_t DEVADC5bits __asm__ ("DEVADC5") __attribute__((section("sfrs"), address(0xBFC45014)));
#define DEVADC7 DEVADC7
extern volatile uint32_t   DEVADC7 __attribute__((section("sfrs"), address(0xBFC45018)));
typedef union {
  struct {
    uint32_t ADCCALDATA:32;
  };
  struct {
    uint32_t w:32;
  };
} __DEVADC7bits_t;
extern volatile __DEVADC7bits_t DEVADC7bits __asm__ ("DEVADC7") __attribute__((section("sfrs"), address(0xBFC45018)));
#define DEVSN0 DEVSN0
extern volatile uint32_t   DEVSN0 __attribute__((section("sfrs"), address(0xBFC45020)));
typedef union {
  struct {
    uint32_t SN:32;
  };
  struct {
    uint32_t w:32;
  };
} __DEVSN0bits_t;
extern volatile __DEVSN0bits_t DEVSN0bits __asm__ ("DEVSN0") __attribute__((section("sfrs"), address(0xBFC45020)));
#define DEVSN1 DEVSN1
extern volatile uint32_t   DEVSN1 __attribute__((section("sfrs"), address(0xBFC45024)));
typedef union {
  struct {
    uint32_t SN:32;
  };
  struct {
    uint32_t w:32;
  };
} __DEVSN1bits_t;
extern volatile __DEVSN1bits_t DEVSN1bits __asm__ ("DEVSN1") __attribute__((section("sfrs"), address(0xBFC45024)));
#define DEVSN2 DEVSN2
extern volatile uint32_t   DEVSN2 __attribute__((section("sfrs"), address(0xBFC45028)));
typedef union {
  struct {
    uint32_t SN:32;
  };
  struct {
    uint32_t w:32;
  };
} __DEVSN2bits_t;
extern volatile __DEVSN2bits_t DEVSN2bits __asm__ ("DEVSN2") __attribute__((section("sfrs"), address(0xBFC45028)));
#define DEVSN3 DEVSN3
extern volatile uint32_t   DEVSN3 __attribute__((section("sfrs"), address(0xBFC4502C)));
typedef union {
  struct {
    uint32_t SN:32;
  };
  struct {
    uint32_t w:32;
  };
} __DEVSN3bits_t;
extern volatile __DEVSN3bits_t DEVSN3bits __asm__ ("DEVSN3") __attribute__((section("sfrs"), address(0xBFC4502C)));
#define DEVEE0 DEVEE0
extern volatile uint32_t   DEVEE0 __attribute__((section("sfrs"), address(0xBFC45030)));
typedef union {
  struct {
    uint32_t EECALDATA:32;
  };
  struct {
    uint32_t w:32;
  };
} __DEVEE0bits_t;
extern volatile __DEVEE0bits_t DEVEE0bits __asm__ ("DEVEE0") __attribute__((section("sfrs"), address(0xBFC45030)));
#define DEVEE1 DEVEE1
extern volatile uint32_t   DEVEE1 __attribute__((section("sfrs"), address(0xBFC45034)));
typedef union {
  struct {
    uint32_t EECALDATA:32;
  };
  struct {
    uint32_t w:32;
  };
} __DEVEE1bits_t;
extern volatile __DEVEE1bits_t DEVEE1bits __asm__ ("DEVEE1") __attribute__((section("sfrs"), address(0xBFC45034)));
#define DEVEE2 DEVEE2
extern volatile uint32_t   DEVEE2 __attribute__((section("sfrs"), address(0xBFC45038)));
typedef union {
  struct {
    uint32_t EECALDATA:32;
  };
  struct {
    uint32_t w:32;
  };
} __DEVEE2bits_t;
extern volatile __DEVEE2bits_t DEVEE2bits __asm__ ("DEVEE2") __attribute__((section("sfrs"), address(0xBFC45038)));
#define DEVEE3 DEVEE3
extern volatile uint32_t   DEVEE3 __attribute__((section("sfrs"), address(0xBFC4503C)));
typedef union {
  struct {
    uint32_t EECALDATA:32;
  };
  struct {
    uint32_t w:32;
  };
} __DEVEE3bits_t;
