Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk0512gpl100.h
extern volatile __AUBADEVCFG0bits_t AUBADEVCFG0bits __asm__ ("AUBADEVCFG0") __attribute__((section("sfrs"), address(0xBFC23F4C)));
#define AUBADEVCP AUBADEVCP
extern volatile uint32_t   AUBADEVCP __attribute__((section("sfrs"), address(0xBFC23F5C)));
typedef union {
  struct {
    uint32_t :28;
    uint32_t CP:1;
  };
  struct {
    uint32_t w:32;
  };
} __AUBADEVCPbits_t;
extern volatile __AUBADEVCPbits_t AUBADEVCPbits __asm__ ("AUBADEVCP") __attribute__((section("sfrs"), address(0xBFC23F5C)));
#define AUBADEVSIGN AUBADEVSIGN
extern volatile uint32_t   AUBADEVSIGN __attribute__((section("sfrs"), address(0xBFC23F6C)));
#define AUBASEQ AUBASEQ
extern volatile uint32_t   AUBASEQ __attribute__((section("sfrs"), address(0xBFC23F70)));
typedef union {
  struct {
    uint32_t TSEQ:16;
    uint32_t CSEQ:16;
  };
  struct {
    uint32_t w:32;
  };
} __AUBASEQbits_t;
extern volatile __AUBASEQbits_t AUBASEQbits __asm__ ("AUBASEQ") __attribute__((section("sfrs"), address(0xBFC23F70)));
#define UBADEVCFG4 UBADEVCFG4
extern volatile uint32_t   UBADEVCFG4 __attribute__((section("sfrs"), address(0xBFC23FBC)));
typedef union {
  struct {
    uint32_t :24;
    uint32_t A1DIFFPR:2;
    uint32_t A2DIFFPR:2;
    uint32_t A3DIFFPR:2;
    uint32_t A5DIFFPR:2;
  };
  struct {
    uint32_t w:32;
  };
} __UBADEVCFG4bits_t;
extern volatile __UBADEVCFG4bits_t UBADEVCFG4bits __asm__ ("UBADEVCFG4") __attribute__((section("sfrs"), address(0xBFC23FBC)));
#define UBADEVCFG3 UBADEVCFG3
extern volatile uint32_t   UBADEVCFG3 __attribute__((section("sfrs"), address(0xBFC23FC0)));
typedef union {
  struct {
    uint32_t USERID:16;
    uint32_t :6;
    uint32_t FUSBIDIO2:1;
    uint32_t FVBUSIO2:1;
    uint32_t :3;
    uint32_t PGL1WAY:1;
    uint32_t PMDL1WAY:1;
    uint32_t IOL1WAY:1;
    uint32_t FUSBIDIO1:1;
    uint32_t FVBUSIO1:1;
  };
  struct {
    uint32_t w:32;
  };
} __UBADEVCFG3bits_t;
extern volatile __UBADEVCFG3bits_t UBADEVCFG3bits __asm__ ("UBADEVCFG3") __attribute__((section("sfrs"), address(0xBFC23FC0)));
#define UBADEVCFG2 UBADEVCFG2
extern volatile uint32_t   UBADEVCFG2 __attribute__((section("sfrs"), address(0xBFC23FC4)));
typedef union {
  struct {
    uint32_t FPLLIDIV:3;
    uint32_t :1;
    uint32_t FPLLRNG:3;
    uint32_t FPLLICLK:1;
    uint32_t FPLLMULT:7;
    uint32_t :1;
    uint32_t FPLLODIV:3;
    uint32_t :1;
    uint32_t DSBOREN:1;
    uint32_t DSWDTPS:5;
    uint32_t DSWDTOSC:1;
    uint32_t DSWDTEN:1;
    uint32_t FDSEN:1;
    uint32_t BORSEL:1;
    uint32_t :1;
    uint32_t UPLLEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __UBADEVCFG2bits_t;
extern volatile __UBADEVCFG2bits_t UBADEVCFG2bits __asm__ ("UBADEVCFG2") __attribute__((section("sfrs"), address(0xBFC23FC4)));
#define UBADEVCFG1 UBADEVCFG1
extern volatile uint32_t   UBADEVCFG1 __attribute__((section("sfrs"), address(0xBFC23FC8)));
typedef union {
  struct {
    uint32_t FNOSC:3;
    uint32_t DMTINTV:3;
    uint32_t FSOSCEN:1;
    uint32_t IESO:1;
    uint32_t POSCMOD:2;
    uint32_t OSCIOFNC:1;
    uint32_t :3;
    uint32_t FCKSM:2;
    uint32_t WDTPS:5;
    uint32_t WDTSPGM:1;
    uint32_t WINDIS:1;
    uint32_t FWDTEN:1;
    uint32_t FWDTWINSZ:2;
    uint32_t DMTCNT:5;
    uint32_t FDMTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __UBADEVCFG1bits_t;
extern volatile __UBADEVCFG1bits_t UBADEVCFG1bits __asm__ ("UBADEVCFG1") __attribute__((section("sfrs"), address(0xBFC23FC8)));
#define UBADEVCFG0 UBADEVCFG0
extern volatile uint32_t   UBADEVCFG0 __attribute__((section("sfrs"), address(0xBFC23FCC)));
typedef union {
  struct {
    uint32_t DEBUG:2;
    uint32_t JTAGEN:1;
    uint32_t ICESEL:2;
    uint32_t TRCEN:1;
    uint32_t BOOTISA:1;
    uint32_t :1;
    uint32_t FECCCON:2;
    uint32_t FSLEEP:1;
    uint32_t :1;
    uint32_t DBGPER:3;
    uint32_t SMCLR:1;
    uint32_t SOSCGAIN:2;
    uint32_t SOSCBOOST:1;
    uint32_t POSCGAIN:2;
    uint32_t POSCBOOST:1;
    uint32_t POSCFGAIN:2;
    uint32_t POSCAGCDLY:2;
    uint32_t POSCAGCRNG:1;
    uint32_t POSCAGC:1;
    uint32_t :2;
    uint32_t EJTAGBEN:1;
  };
  struct {
    uint32_t FDEBUG:2;
  };
  struct {
    uint32_t w:32;
  };
} __UBADEVCFG0bits_t;
extern volatile __UBADEVCFG0bits_t UBADEVCFG0bits __asm__ ("UBADEVCFG0") __attribute__((section("sfrs"), address(0xBFC23FCC)));
#define UBADEVCP UBADEVCP
extern volatile uint32_t   UBADEVCP __attribute__((section("sfrs"), address(0xBFC23FDC)));
typedef union {
  struct {
    uint32_t :28;
    uint32_t CP:1;
  };
  struct {
    uint32_t w:32;
  };
} __UBADEVCPbits_t;
extern volatile __UBADEVCPbits_t UBADEVCPbits __asm__ ("UBADEVCP") __attribute__((section("sfrs"), address(0xBFC23FDC)));
#define UBADEVSIGN UBADEVSIGN
extern volatile uint32_t   UBADEVSIGN __attribute__((section("sfrs"), address(0xBFC23FEC)));
#define UBASEQ UBASEQ
extern volatile uint32_t   UBASEQ __attribute__((section("sfrs"), address(0xBFC23FF0)));
typedef union {
  struct {
    uint32_t TSEQ:16;
    uint32_t CSEQ:16;
  };
  struct {
    uint32_t w:32;
  };
} __UBASEQbits_t;
extern volatile __UBASEQbits_t UBASEQbits __asm__ ("UBASEQ") __attribute__((section("sfrs"), address(0xBFC23FF0)));
#define ABF1DEVCFG4 ABF1DEVCFG4
extern volatile uint32_t   ABF1DEVCFG4 __attribute__((section("sfrs"), address(0xBFC43F3C)));
typedef union {
  struct {
    uint32_t :24;
    uint32_t A1DIFFPR:2;
    uint32_t A2DIFFPR:2;
    uint32_t A3DIFFPR:2;
    uint32_t A5DIFFPR:2;
  };
  struct {
    uint32_t w:32;
  };
} __ABF1DEVCFG4bits_t;
extern volatile __ABF1DEVCFG4bits_t ABF1DEVCFG4bits __asm__ ("ABF1DEVCFG4") __attribute__((section("sfrs"), address(0xBFC43F3C)));
#define ABF1DEVCFG3 ABF1DEVCFG3
extern volatile uint32_t   ABF1DEVCFG3 __attribute__((section("sfrs"), address(0xBFC43F40)));
typedef union {
  struct {
    uint32_t USERID:16;
    uint32_t :6;
    uint32_t FUSBIDIO2:1;
    uint32_t FVBUSIO2:1;
    uint32_t :3;
    uint32_t PGL1WAY:1;
    uint32_t PMDL1WAY:1;
    uint32_t IOL1WAY:1;
    uint32_t FUSBIDIO1:1;
    uint32_t FVBUSIO1:1;
  };
  struct {
    uint32_t w:32;
  };
} __ABF1DEVCFG3bits_t;
