Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk0512gpl100.h
#define _PMD6_QEI6MD_POSITION                    0x00000013
#define _PMD6_QEI6MD_MASK                        0x00080000
#define _PMD6_QEI6MD_LENGTH                      0x00000001

#define _PMD6_QEI1MD_POSITION                    0x00000018
#define _PMD6_QEI1MD_MASK                        0x01000000
#define _PMD6_QEI1MD_LENGTH                      0x00000001

#define _PMD6_QEI2MD_POSITION                    0x00000019
#define _PMD6_QEI2MD_MASK                        0x02000000
#define _PMD6_QEI2MD_LENGTH                      0x00000001

#define _PMD6_QEI3MD_POSITION                    0x0000001A
#define _PMD6_QEI3MD_MASK                        0x04000000
#define _PMD6_QEI3MD_LENGTH                      0x00000001

#define _PMD6_QEI4MD_POSITION                    0x0000001B
#define _PMD6_QEI4MD_MASK                        0x08000000
#define _PMD6_QEI4MD_LENGTH                      0x00000001

#define _PMD7_DMAMD_POSITION                     0x00000004
#define _PMD7_DMAMD_MASK                         0x00000010
#define _PMD7_DMAMD_LENGTH                       0x00000001

#define _CFGPG_CPUPG_POSITION                    0x00000000
#define _CFGPG_CPUPG_MASK                        0x00000003
#define _CFGPG_CPUPG_LENGTH                      0x00000002

#define _CFGPG_DMAPG_POSITION                    0x00000004
#define _CFGPG_DMAPG_MASK                        0x00000030
#define _CFGPG_DMAPG_LENGTH                      0x00000002

#define _CFGPG_CAN1PG_POSITION                   0x0000000C
#define _CFGPG_CAN1PG_MASK                       0x00003000
#define _CFGPG_CAN1PG_LENGTH                     0x00000002

#define _CFGPG_FCPG_POSITION                     0x00000016
#define _CFGPG_FCPG_MASK                         0x00C00000
#define _CFGPG_FCPG_LENGTH                       0x00000002

#define _CFGPG_ADCPG_POSITION                    0x00000018
#define _CFGPG_ADCPG_MASK                        0x03000000
#define _CFGPG_ADCPG_LENGTH                      0x00000002

#define _CFGAPP2_POSCFAIL_POSITION               0x00000015
#define _CFGAPP2_POSCFAIL_MASK                   0x00200000
#define _CFGAPP2_POSCFAIL_LENGTH                 0x00000001

#define _CFGCON2_EEWS_POSITION                   0x00000000
#define _CFGCON2_EEWS_MASK                       0x000000FF
#define _CFGCON2_EEWS_LENGTH                     0x00000008

#define _CHECON_PFMWS_POSITION                   0x00000000
#define _CHECON_PFMWS_MASK                       0x0000000F
#define _CHECON_PFMWS_LENGTH                     0x00000004

#define _CHECON_PREFEN_POSITION                  0x00000004
#define _CHECON_PREFEN_MASK                      0x00000030
#define _CHECON_PREFEN_LENGTH                    0x00000002

#define _CHECON_PFMSECEN_POSITION                0x00000007
#define _CHECON_PFMSECEN_MASK                    0x00000080
#define _CHECON_PFMSECEN_LENGTH                  0x00000001

#define _CHECON_PFMAWSEN_POSITION                0x00000008
#define _CHECON_PFMAWSEN_MASK                    0x00000100
#define _CHECON_PFMAWSEN_LENGTH                  0x00000001

#define _CHECON_CHEPERFEN_POSITION               0x0000000C
#define _CHECON_CHEPERFEN_MASK                   0x00001000
#define _CHECON_CHEPERFEN_LENGTH                 0x00000001

#define _CHECON_ICHECOH_POSITION                 0x00000010
#define _CHECON_ICHECOH_MASK                     0x00010000
#define _CHECON_ICHECOH_LENGTH                   0x00000001

#define _CHECON_DCHECOH_POSITION                 0x00000011
#define _CHECON_DCHECOH_MASK                     0x00020000
#define _CHECON_DCHECOH_LENGTH                   0x00000001

#define _CHECON_PERCHECOH_POSITION               0x00000012
#define _CHECON_PERCHECOH_MASK                   0x00040000
#define _CHECON_PERCHECOH_LENGTH                 0x00000001

#define _CHECON_ICHEINV_POSITION                 0x00000014
#define _CHECON_ICHEINV_MASK                     0x00100000
#define _CHECON_ICHEINV_LENGTH                   0x00000001

#define _CHECON_DCHEINV_POSITION                 0x00000015
#define _CHECON_DCHEINV_MASK                     0x00200000
#define _CHECON_DCHEINV_LENGTH                   0x00000001

#define _CHECON_PERCHEINV_POSITION               0x00000016
#define _CHECON_PERCHEINV_MASK                   0x00400000
#define _CHECON_PERCHEINV_LENGTH                 0x00000001

#define _CHECON_ICHEEN_POSITION                  0x00000018
#define _CHECON_ICHEEN_MASK                      0x01000000
#define _CHECON_ICHEEN_LENGTH                    0x00000001

#define _CHECON_DCHEEN_POSITION                  0x00000019
#define _CHECON_DCHEEN_MASK                      0x02000000
#define _CHECON_DCHEEN_LENGTH                    0x00000001

#define _CHECON_PERCHEEN_POSITION                0x0000001A
#define _CHECON_PERCHEEN_MASK                    0x04000000
#define _CHECON_PERCHEEN_LENGTH                  0x00000001

#define _CHESTAT_PFMSECCNT_POSITION              0x00000000
#define _CHESTAT_PFMSECCNT_MASK                  0x000000FF
#define _CHESTAT_PFMSECCNT_LENGTH                0x00000008

#define _CHESTAT_PFMSEC_POSITION                 0x0000001A
#define _CHESTAT_PFMSEC_MASK                     0x04000000
#define _CHESTAT_PFMSEC_LENGTH                   0x00000001

#define _CHESTAT_PFMDED_POSITION                 0x0000001B
#define _CHESTAT_PFMDED_MASK                     0x08000000
#define _CHESTAT_PFMDED_LENGTH                   0x00000001

#define _CHEHIT_CHEHIT_POSITION                  0x00000000
#define _CHEHIT_CHEHIT_MASK                      0xFFFFFFFF
#define _CHEHIT_CHEHIT_LENGTH                    0x00000020

#define _CHEMIS_CHEMIS_POSITION                  0x00000000
#define _CHEMIS_CHEMIS_MASK                      0xFFFFFFFF
#define _CHEMIS_CHEMIS_LENGTH                    0x00000020

#define _NVMCON_NVMOP_POSITION                   0x00000000
#define _NVMCON_NVMOP_MASK                       0x0000000F
#define _NVMCON_NVMOP_LENGTH                     0x00000004

#define _NVMCON_BFSWAP_POSITION                  0x00000006
#define _NVMCON_BFSWAP_MASK                      0x00000040
#define _NVMCON_BFSWAP_LENGTH                    0x00000001

#define _NVMCON_PFSWAP_POSITION                  0x00000007
#define _NVMCON_PFSWAP_MASK                      0x00000080
#define _NVMCON_PFSWAP_LENGTH                    0x00000001

