Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.44/include/proc/p32mk0512gpl100.h
#define _CFD1MASK8_MSID_POSITION                 0x00000000
#define _CFD1MASK8_MSID_MASK                     0x000007FF
#define _CFD1MASK8_MSID_LENGTH                   0x0000000B

#define _CFD1MASK8_MEID_POSITION                 0x0000000B
#define _CFD1MASK8_MEID_MASK                     0x1FFFF800
#define _CFD1MASK8_MEID_LENGTH                   0x00000012

#define _CFD1MASK8_MSID11_POSITION               0x0000001D
#define _CFD1MASK8_MSID11_MASK                   0x20000000
#define _CFD1MASK8_MSID11_LENGTH                 0x00000001

#define _CFD1MASK8_MIDE_POSITION                 0x0000001E
#define _CFD1MASK8_MIDE_MASK                     0x40000000
#define _CFD1MASK8_MIDE_LENGTH                   0x00000001

#define _CFD1FLTOBJ9_SID_POSITION                0x00000000
#define _CFD1FLTOBJ9_SID_MASK                    0x000007FF
#define _CFD1FLTOBJ9_SID_LENGTH                  0x0000000B

#define _CFD1FLTOBJ9_EID_POSITION                0x0000000B
#define _CFD1FLTOBJ9_EID_MASK                    0x1FFFF800
#define _CFD1FLTOBJ9_EID_LENGTH                  0x00000012

#define _CFD1FLTOBJ9_SID11_POSITION              0x0000001D
#define _CFD1FLTOBJ9_SID11_MASK                  0x20000000
#define _CFD1FLTOBJ9_SID11_LENGTH                0x00000001

#define _CFD1FLTOBJ9_EXIDE_POSITION              0x0000001E
#define _CFD1FLTOBJ9_EXIDE_MASK                  0x40000000
#define _CFD1FLTOBJ9_EXIDE_LENGTH                0x00000001

#define _CFD1MASK9_MSID_POSITION                 0x00000000
#define _CFD1MASK9_MSID_MASK                     0x000007FF
#define _CFD1MASK9_MSID_LENGTH                   0x0000000B

#define _CFD1MASK9_MEID_POSITION                 0x0000000B
#define _CFD1MASK9_MEID_MASK                     0x1FFFF800
#define _CFD1MASK9_MEID_LENGTH                   0x00000012

#define _CFD1MASK9_MSID11_POSITION               0x0000001D
#define _CFD1MASK9_MSID11_MASK                   0x20000000
#define _CFD1MASK9_MSID11_LENGTH                 0x00000001

#define _CFD1MASK9_MIDE_POSITION                 0x0000001E
#define _CFD1MASK9_MIDE_MASK                     0x40000000
#define _CFD1MASK9_MIDE_LENGTH                   0x00000001

#define _CFD1FLTOBJ10_SID_POSITION               0x00000000
#define _CFD1FLTOBJ10_SID_MASK                   0x000007FF
#define _CFD1FLTOBJ10_SID_LENGTH                 0x0000000B

#define _CFD1FLTOBJ10_EID_POSITION               0x0000000B
#define _CFD1FLTOBJ10_EID_MASK                   0x1FFFF800
#define _CFD1FLTOBJ10_EID_LENGTH                 0x00000012

#define _CFD1FLTOBJ10_SID11_POSITION             0x0000001D
#define _CFD1FLTOBJ10_SID11_MASK                 0x20000000
#define _CFD1FLTOBJ10_SID11_LENGTH               0x00000001

#define _CFD1FLTOBJ10_EXIDE_POSITION             0x0000001E
#define _CFD1FLTOBJ10_EXIDE_MASK                 0x40000000
#define _CFD1FLTOBJ10_EXIDE_LENGTH               0x00000001

#define _CFD1MASK10_MSID_POSITION                0x00000000
#define _CFD1MASK10_MSID_MASK                    0x000007FF
#define _CFD1MASK10_MSID_LENGTH                  0x0000000B

#define _CFD1MASK10_MEID_POSITION                0x0000000B
#define _CFD1MASK10_MEID_MASK                    0x1FFFF800
#define _CFD1MASK10_MEID_LENGTH                  0x00000012

#define _CFD1MASK10_MSID11_POSITION              0x0000001D
#define _CFD1MASK10_MSID11_MASK                  0x20000000
#define _CFD1MASK10_MSID11_LENGTH                0x00000001

#define _CFD1MASK10_MIDE_POSITION                0x0000001E
#define _CFD1MASK10_MIDE_MASK                    0x40000000
#define _CFD1MASK10_MIDE_LENGTH                  0x00000001

#define _CFD1FLTOBJ11_SID_POSITION               0x00000000
#define _CFD1FLTOBJ11_SID_MASK                   0x000007FF
#define _CFD1FLTOBJ11_SID_LENGTH                 0x0000000B

#define _CFD1FLTOBJ11_EID_POSITION               0x0000000B
#define _CFD1FLTOBJ11_EID_MASK                   0x1FFFF800
#define _CFD1FLTOBJ11_EID_LENGTH                 0x00000012

#define _CFD1FLTOBJ11_SID11_POSITION             0x0000001D
#define _CFD1FLTOBJ11_SID11_MASK                 0x20000000
#define _CFD1FLTOBJ11_SID11_LENGTH               0x00000001

#define _CFD1FLTOBJ11_EXIDE_POSITION             0x0000001E
#define _CFD1FLTOBJ11_EXIDE_MASK                 0x40000000
#define _CFD1FLTOBJ11_EXIDE_LENGTH               0x00000001

#define _CFD1MASK11_MSID_POSITION                0x00000000
#define _CFD1MASK11_MSID_MASK                    0x000007FF
#define _CFD1MASK11_MSID_LENGTH                  0x0000000B

#define _CFD1MASK11_MEID_POSITION                0x0000000B
#define _CFD1MASK11_MEID_MASK                    0x1FFFF800
#define _CFD1MASK11_MEID_LENGTH                  0x00000012

#define _CFD1MASK11_MSID11_POSITION              0x0000001D
#define _CFD1MASK11_MSID11_MASK                  0x20000000
#define _CFD1MASK11_MSID11_LENGTH                0x00000001

#define _CFD1MASK11_MIDE_POSITION                0x0000001E
#define _CFD1MASK11_MIDE_MASK                    0x40000000
#define _CFD1MASK11_MIDE_LENGTH                  0x00000001

#define _CFD1FLTOBJ12_SID_POSITION               0x00000000
#define _CFD1FLTOBJ12_SID_MASK                   0x000007FF
#define _CFD1FLTOBJ12_SID_LENGTH                 0x0000000B

#define _CFD1FLTOBJ12_EID_POSITION               0x0000000B
#define _CFD1FLTOBJ12_EID_MASK                   0x1FFFF800
#define _CFD1FLTOBJ12_EID_LENGTH                 0x00000012

#define _CFD1FLTOBJ12_SID11_POSITION             0x0000001D
#define _CFD1FLTOBJ12_SID11_MASK                 0x20000000
#define _CFD1FLTOBJ12_SID11_LENGTH               0x00000001

#define _CFD1FLTOBJ12_EXIDE_POSITION             0x0000001E
#define _CFD1FLTOBJ12_EXIDE_MASK                 0x40000000
#define _CFD1FLTOBJ12_EXIDE_LENGTH               0x00000001

#define _CFD1MASK12_MSID_POSITION                0x00000000
#define _CFD1MASK12_MSID_MASK                    0x000007FF
#define _CFD1MASK12_MSID_LENGTH                  0x0000000B

#define _CFD1MASK12_MEID_POSITION                0x0000000B
#define _CFD1MASK12_MEID_MASK                    0x1FFFF800
#define _CFD1MASK12_MEID_LENGTH                  0x00000012

#define _CFD1MASK12_MSID11_POSITION              0x0000001D
#define _CFD1MASK12_MSID11_MASK                  0x20000000
#define _CFD1MASK12_MSID11_LENGTH                0x00000001

#define _CFD1MASK12_MIDE_POSITION                0x0000001E
#define _CFD1MASK12_MIDE_MASK                    0x40000000
#define _CFD1MASK12_MIDE_LENGTH                  0x00000001

